// var date = String(new Date());
// console.log(date);

// повернеться теперішня дата і час в форматі
// Wed Nov 08 2017 07:44:05 GMT+0200 (EET)
// можна вивести і побачити

// написати функцію, яка приймає масив обєктів
var users = [
  {
    name: "user1",
    age: 25
  },
  {
    name: "user2",
    age: 15
  },
  {
    name: "user3",
    age: 33
  },
  {
    name: "user4",
    age: 42
  },
  {
    name: "user5",
    age: 60
  }
]

// функція повинна кожному бзеру створити властивість
// yearOfBirthday(можна коротшу назву)
// яка буде означати рік народження юзера

// потрібно теперішній рік відняти від віку юзера

// використовувати метод new Date(), а не просто 2017
// тому що код має працювати не тільки в 2017 році)

// потрібно правильно розпарсити date і дістати рік



function func(arr){

}

console.log(func(users));
