//tasks/task1.js

// об'єкти
// в об'єктах можна зберігати любі дані

//postman
// синтаксис


// 1 варіант
var obj = new Object();


// 2 варіант
var obj = {};


// створення ключів об'єкту
// var user = {};
//
// user.name = "Ivan";
// console.log(user);

// об'єкт може зберігати любі данні

// var user2 = {};
//
// user2.name = "Vasya";
// user2.age = 15;
// user2.isMarried = true;
// user2.tel = null;
//
// console.log(user2);



// значення обєктів можна міняти
// user2.name = "Petya";
// console.log(user2.name);



// при створенні об'єктів, створюється посилання
// на комірку памяті, де зберігається обєкт

// тому наприклад копіюванні стрічки
// (та інші примітивні типи) копіюються повністю
// var str = "123";
// var str2 = str;

// і при спробі змінити одну стрічку, друга не поміняється
// str = "456";
// console.log(str, "first");
// console.log(str2, "second");




// а коли копіюються обєкти таким самим способом
// відбувається наступне

// var obj1 = {};
// obj1.name = "Vasya";
//
// var obj2 = obj1;
//
// //міняємо значення name
// obj2.name = "Petya";
//
// console.log(obj1, "obj1"); //помінялося імя у двох обєктів
// console.log(obj2, "obj2");


// це відбулося тому, що при копіюванні обєктів
// передається посилання на обєкт


// tasks/task2.js
