// Логічне АБО

// Приводить всі аргументи до логічного типу.
// Зупиняється, коли знаходить перше true

var name = "John";
var surname = "";
if(name || surname){
  console.log("do domething");
}


// не виконається, бо name і surname повернуть false
name = "";
if(name || surname){
  console.log("nope");
}


var age1 = 25;
var age2 = 0;

// не виконається, age == 26 поверне false, age2 конвертується в логічний тип і поверне false
if(age1 == 26 || age2){
  console.log("nope");
}

// виконається, бо age1 == 26 поверне true і далі шукати не буде
age1 = 26;
if(age1 == 26 || age2){
  console.log("yeap");
}



// Можна присвоїти значення змінної, яка повернула true
var num = 0;
var str = "lol";
var bool = false;


var res = bool || str || num;
console.log(res);


// Якщо в рядку порівняння всі значення false, то в змінну запишеться останнє значення.
str = '';
res = bool || str || num;
console.log(res);



// task
// використовуючи if else і логічне або превірити чи вік користувача є в діапазоні між 18-60(наприклад рекомендації для прийому якихось ліків)
// якщо юзеру менше 18 - написати щоб не пив ліків
// якщо більше 60 , також написати щоб не пив ліків
// якщо вік знаходиться в діапазоні 18-60 - сказати, що може пити
// "казати" можна використовуючи console.log() або alert().
// для того щоб спитати, можна використати метод prompt або просто створити змінну age з любим віком.
