// цикл for

// працює так само як і while
// тільки інакший синтаксис
// і інакше призачення


// for(початок;умова;крок){
//   тіло циклу
// }



// for(var i = 0; i < 10; i++){
//   console.log(i); // виведе 0,1 .. 9
// }



// той самий цикл через while
// var i = 0;
// while(i < 10){
//   console.log(i);
//   i++;
// }



// можна пропустити початок або крок
// var i = 0;
// for( ;i < 10;){
//   console.log(i);
//   i++;
// }


// break --> закінчує цикл


//коли і = 5, закінчиться цикл
// for(var i = 0; i < 10; i++){
//   console.log(i);
//   if(i == 5){
//     break;
//   }
// }


// continue -->переходить на
// наступну ітерацію



//пропустить 5
// for(var i = 0; i < 10; i++){
//   if(i == 5){
//     continue;
//   }
//   console.log(i);
// }





//tasks/task4.js
