// глобальні і локальні змінні
// var a = 5;
// a - глобальна змінна
// ми можемо звернутися до неї з любого місця скрипта


// function someFunc() {
//   var a = 5;
//   a - локальна змінна , вона видима тільки в тілі функції
//   і звертати ми можемо до неї тільки в цій функці
// }


// function someFunc() {
//   var a = 5;
// }
//
// someFunc();
//
// console.log(a);
//буде помилка




// var a = 10; //глобальна
//
// function func() {
//   // створюється локальна змінна
//   // і вона ж повертається
//   var a = 5;
//   return a;
// }
// console.log(func()); // виведеться локальна змінна
// console.log(a); // виведеться глобальна змінна







// якщо функція повертає значення, яке не може
// знайти в локальному середовищі
// тоді вона виходить на рівень вище і шукає в глобальному

// var a = 10;
// function someFunc() {
//   return a;
// }
//
//
// console.log(someFunc()); // виведеться глобальна змінна 10





// в локальному середовищі можна міняти
// глобальні змінні

// наприклад
// var a = "hello";
//
// function change() {
//   a = "world"; // змінюється глобальна змінна а
//
//
//   // якби було так
//   // var a = "world";
//   // то в функції створилася б локальна
//   // змінна, а глобальна не змінилася б
//   return a;
// }
//
// console.log(change());// виведеться world
// console.log(a); // виведеться world



// Краще не міняти глобальні змінні
//
// Чисті функції


// tasks/task7.js
